#include "Date.h"
int main()
{
	//Date d1(1997,10,12);
	//d1.Print();
	//Date d2(d1);   //拷贝构造函数，不能有指针，会导致d2和d1的指针指向同一块空间
	//d2.Print();
////////////////////////////////////////////////////////////////
	/*Date d3(1997,10,12);
	d1 = d2 = d3;
	d1.Print();
	d2.Print();
	d3.Print();*/
///////////////////////////////////////////////////////////////
	//const Date d1(2018,10,28);
	//d1.Display();                 //const对象可以调用const成员函数
	////d1.Print();                   //const对象不能调用非const成员函数
	//Date d2(2000, 6, 12);           
	//d2.Print();                   //非const对象可以调用非const成员函数
	//d2.Display();                 //非const对象可以调用const成员函数
	//                              //const成员函数内可以调用其它的const成员函数，但不能调用非const成员函数
	//							  //非const成员函数内可以调用其它的const成员函数和非const成员函数
////////////////////////////////////////////////////////////
	/*Date d1(12);
	d1.Print();
	d1 = 2016;
	d1.Print();*/
////////////////////////////////////////////////////////////
	Date d2;
	d2.setDate(2018, 10, 28);
	d2.Print();
	return 0;

}